# DEVINCEPT 

## SHIVANI PANKHANIA 
## ASSIGNMENT FOR MODULE 3
 
## PANDAS

In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}
purchases = pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [5]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [6]:
purchases.loc['June']

apples     3
oranges    0
Name: June, dtype: int64

In [7]:
purchases.head()

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [9]:
purchases.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, June to David
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   apples   4 non-null      int64
 1   oranges  4 non-null      int64
dtypes: int64(2)
memory usage: 268.0+ bytes

In [11]:
purchases.isnull()

        apples  oranges
June     False    False
Robert   False    False
Lily     False    False
David    False    False

In [12]:
purchases.shape

(4, 2)

In [13]:
purchases.columns

Index(['apples', 'oranges'], dtype='object')

In [15]:
purchases.mean()

apples     1.5
oranges    3.0
dtype: float64

In [17]:
purchases.median()

apples     1.5
oranges    2.5
dtype: float64

In [19]:
purchases.mode()

   apples  oranges
0       0        0
1       1        2
2       2        3
3       3        7

In [22]:
app = purchases.loc["June"]
app

apples     3
oranges    0
Name: June, dtype: int64

In [24]:
pur = purchases.iloc[1:3]
pur

        apples  oranges
Robert       2        3
Lily         0        7